Repository: Git-Rocky-Stack/Agent-X
Catalog: src/AgentX.App/Strings/*/Resources.resw
Source language: en_us
Languages: de, es, fr, ja, zh_cn

# Ana_ModelUsageSubtitle.Text
source: AI model distribution by conversation count
de: Verteilung der KI-Modelle nach Konversationsanzahl
es: Distribución de modelos de IA por número de conversaciones
fr: Répartition des modèles d'IA par nombre de conversations
ja: 会話数による AI モデルの分布
zh_cn: 按会话数统计的 AI 模型分布

# Ana_NoModelData.Text
source: No model data yet. Start a conversation to see model usage.
de: Noch keine Modelldaten. Starten Sie eine Konversation, um die Modellnutzung zu sehen.
es: Aún no hay datos de modelos. Inicie una conversación para ver el uso.
fr: Pas encore de données de modèles. Démarrez une conversation pour voir l'utilisation.
ja: モデル データはまだありません。会話を開始するとモデル使用状況が表示されます。
zh_cn: 暂无模型数据。开始会话即可查看模型使用情况。

# Ana_DocTypesTitle.Text
source: Document Types
de: Dokumenttypen
es: Tipos de documento
fr: Types de documents
ja: ドキュメントの種類
zh_cn: 文档类型

# Ana_DocTypesSubtitle.Text
source: File type breakdown across your knowledge vault
de: Dateityp-Aufschlüsselung in Ihrem Wissens-Tresor
es: Desglose por tipo de archivo en su bóveda de conocimiento
fr: Répartition par type de fichier dans votre coffre-fort de connaissances
ja: Knowledge Vault 内のファイル タイプの内訳
zh_cn: Knowledge Vault 中的文件类型分布

# Ana_NoDocsImported.Text
source: No documents imported yet. Add files to your Knowledge Vault to see type distribution.
de: Noch keine Dokumente importiert. Fügen Sie Ihrem Wissens-Tresor Dateien hinzu, um die Typverteilung zu sehen.
es: Aún no hay documentos importados. Añada archivos a su bóveda de conocimiento para ver la distribución por tipo.
fr: Aucun document importé pour le moment. Ajoutez des fichiers à votre coffre-fort de connaissances pour voir la répartition par type.
ja: インポートされたドキュメントはまだありません。Knowledge Vault にファイルを追加すると種類別の分布が表示されます。
zh_cn: 尚未导入文档。向 Knowledge Vault 添加文件即可查看类型分布。

# Ana_PerfTitle.Text
source: Performance Metrics
de: Leistungsmetriken
es: Métricas de rendimiento
fr: Métriques de performance
ja: パフォーマンス指標
zh_cn: 性能指标

# Ana_PerfSubtitle.Text
source: AI inference timing statistics across all assistant responses
de: Zeitstatistiken der KI-Inferenz über alle Assistentenantworten
es: Estadísticas de tiempos de inferencia de IA en todas las respuestas del asistente
fr: Statistiques de temps d'inférence de l'IA sur toutes les réponses de l'assistant
ja: すべてのアシスタント応答にわたる AI 推論時間の統計
zh_cn: 所有助手回复的 AI 推理耗时统计

# Ana_NoTimingData.Text
source: No timing data yet. Response times are tracked automatically after the first AI reply.
de: Noch keine Zeitdaten. Antwortzeiten werden nach der ersten KI-Antwort automatisch erfasst.
es: Aún no hay datos de tiempos. Los tiempos de respuesta se registran automáticamente tras la primera respuesta de la IA.
fr: Pas encore de données de temps. Les temps de réponse sont suivis automatiquement après la première réponse de l'IA.
ja: 時間データはまだありません。最初の AI 応答の後、応答時間は自動的に記録されます。
zh_cn: 暂无耗时数据。首次 AI 回复后将自动跟踪响应时间。

# Ana_AvgOverline.Text
source: AVERAGE
de: DURCHSCHNITT
es: PROMEDIO
fr: MOYENNE
ja: 平均
zh_cn: 平均

# Ana_AvgCaption.Text
source: Mean response time
de: Mittlere Antwortzeit
es: Tiempo medio de respuesta
fr: Temps de réponse moyen
ja: 平均応答時間
zh_cn: 平均响应时间

# Ana_MedianOverline.Text
source: MEDIAN (P50)
es: MEDIANA (P50)
fr: MÉDIANE (P50)
ja: 中央値(P50)
zh_cn: 中位数(P50)

# Ana_MedianCaption.Text
source: Half of responses are faster
de: Die Hälfte der Antworten ist schneller
es: La mitad de las respuestas son más rápidas
fr: La moitié des réponses sont plus rapides
ja: 応答の半数はこれより速い
zh_cn: 一半的响应快于此值

# Ana_P95Caption.Text
source: 95th-percentile latency
de: Latenz im 95. Perzentil
es: Latencia del percentil 95
fr: Latence au 95e percentile
ja: 95 パーセンタイルのレイテンシ
zh_cn: 第 95 百分位延迟

# Ana_ThroughputOverline.Text
source: THROUGHPUT
de: DURCHSATZ
es: RENDIMIENTO
fr: DÉBIT
ja: スループット
zh_cn: 吞吐量

# Ana_ThroughputCaption.Text
source: Avg tokens per second
de: Ø Tokens pro Sekunde
es: Tokens por segundo (promedio)
fr: Tokens par seconde (moyenne)
ja: 1 秒あたりの平均トークン数
zh_cn: 平均每秒 token 数

# Ana_FastestOverline.Text
source: FASTEST
de: SCHNELLSTE
es: MÁS RÁPIDA
fr: LA PLUS RAPIDE
ja: 最速
zh_cn: 最快

# Ana_FastestCaption.Text
source: Best observed response
de: Beste beobachtete Antwort
es: Mejor respuesta observada
fr: Meilleure réponse observée
ja: 観測された最速の応答
zh_cn: 观测到的最快响应

# Ana_SlowestOverline.Text
source: SLOWEST
de: LANGSAMSTE
es: MÁS LENTA
fr: LA PLUS LENTE
ja: 最も遅い
zh_cn: 最慢

# Ana_SlowestCaption.Text
source: Worst observed response
de: Langsamste beobachtete Antwort
es: Peor respuesta observada
fr: Pire réponse observée
ja: 観測された最も遅い応答
zh_cn: 观测到的最慢响应

# Ana_TotalInfOverline.Text
source: TOTAL INFERENCE TIME
de: GESAMTE INFERENZZEIT
es: TIEMPO TOTAL DE INFERENCIA
fr: TEMPS D'INFÉRENCE TOTAL
ja: 推論時間合計
zh_cn: 总推理时间

# Ana_TotalInfCaption.Text
source: Cumulative AI generation time across all sessions
de: Kumulierte KI-Generierungszeit über alle Sitzungen
es: Tiempo acumulado de generación de IA en todas las sesiones
fr: Temps cumulé de génération de l'IA sur toutes les sessions
ja: 全セッションにわたる AI 生成時間の累計
zh_cn: 所有会话累计的 AI 生成时间

# Sync_Title.Text
source: COLLABORATIVE SYNC
ja: Collaborative Sync(コラボ同期)
zh_cn: Collaborative Sync(协作同步)

# Sync_Subtitle.Text
source: Configure encrypted sync between Agent-X installations.
de: Konfigurieren Sie die verschlüsselte Synchronisierung zwischen Agent-X-Installationen.
es: Configure la sincronización cifrada entre instalaciones de Agent-X.
fr: Configurez la synchronisation chiffrée entre les installations Agent-X.
ja: Agent-X インストール間の暗号化同期を設定します。
zh_cn: 配置 Agent-X 安装实例之间的加密同步。

# Sync_SyncNowLabel.Text
source: Sync Now
de: Jetzt synchronisieren
es: Sincronizar ahora
fr: Synchroniser maintenant
ja: 今すぐ同期
zh_cn: 立即同步

# Sync_LoadingSettings.Text
source: Loading sync settings...
de: Sync-Einstellungen werden geladen...
es: Cargando ajustes de sincronización...
fr: Chargement des paramètres de synchronisation...
ja: 同期設定を読み込んでいます...
zh_cn: 正在加载同步设置...

# Sync_NotConfiguredTitle.Text
source: Sync not configured
de: Synchronisierung nicht konfiguriert
es: Sincronización sin configurar
fr: Synchronisation non configurée
ja: 同期は未設定です
zh_cn: 尚未配置同步

# Sync_NotConfiguredHint.Text
source: Set up a shared sync folder and encryption key to securely synchronize your knowledge vault, collections, and settings between Agent-X installations.
de: Richten Sie einen gemeinsamen Sync-Ordner und einen Verschlüsselungsschlüssel ein, um Wissens-Tresor, Sammlungen und Einstellungen sicher zwischen Agent-X-Installationen zu synchronisieren.
es: Configure una carpeta de sincronización compartida y una clave de cifrado para sincronizar de forma segura su bóveda de conocimiento, colecciones y ajustes entre instalaciones de Agent-X.
fr: Configurez un dossier de synchronisation partagé et une clé de chiffrement pour synchroniser en toute sécurité votre coffre-fort de connaissances, vos collections et vos paramètres entre installations Agent-X.
ja: 共有同期フォルダーと暗号化キーを設定すると、Agent-X インストール間で Knowledge Vault、コレクション、設定を安全に同期できます。
zh_cn: 设置共享同步文件夹和加密密钥,即可在 Agent-X 安装实例之间安全同步 Knowledge Vault、合集与设置。

# Sync_E2ENote.Text
source: All sync data is encrypted end-to-end with your key.
de: Alle Sync-Daten werden mit Ihrem Schlüssel Ende-zu-Ende verschlüsselt.
es: Todos los datos de sincronización se cifran de extremo a extremo con su clave.
fr: Toutes les données de synchronisation sont chiffrées de bout en bout avec votre clé.
ja: すべての同期データは、お客様のキーでエンドツーエンド暗号化されます。
zh_cn: 所有同步数据均使用您的密钥进行端到端加密。

# Sync_ConfigTitle.Text
source: Configuration
de: Konfiguration
es: Configuración
ja: 構成
zh_cn: 配置

# Sync_ConfigSubtitle.Text
source: Set the shared folder path and encryption key used to sync data between devices.
de: Legen Sie den Pfad des gemeinsamen Ordners und den Verschlüsselungsschlüssel für die Synchronisierung zwischen Geräten fest.
es: Establezca la ruta de la carpeta compartida y la clave de cifrado usadas para sincronizar datos entre dispositivos.
fr: Définissez le chemin du dossier partagé et la clé de chiffrement utilisés pour synchroniser les données entre appareils.
ja: デバイス間のデータ同期に使用する共有フォルダーのパスと暗号化キーを設定します。
zh_cn: 设置用于在设备间同步数据的共享文件夹路径和加密密钥。

# Sync_FolderLabel.Text
source: Sync Folder
de: Sync-Ordner
es: Carpeta de sincronización
fr: Dossier de synchronisation
ja: 同期フォルダー
zh_cn: 同步文件夹

# Sync_FolderBox.PlaceholderText
source: C:\Users\Shared\AgentX-Sync or \\NAS\AgentX
de: C:\Users\Shared\AgentX-Sync oder \\NAS\AgentX
es: C:\Users\Shared\AgentX-Sync o \\NAS\AgentX
fr: C:\Users\Shared\AgentX-Sync ou \\NAS\AgentX
ja: C:\Users\Shared\AgentX-Sync または \\NAS\AgentX
zh_cn: C:\Users\Shared\AgentX-Sync 或 \\NAS\AgentX

# Sync_BrowseLabel.Text
source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir
ja: 参照
zh_cn: 浏览

# Sync_FolderHint.Text
source: Choose a network share, cloud-synced folder (OneDrive, Dropbox), or any shared location.
de: Wählen Sie eine Netzwerkfreigabe, einen cloud-synchronisierten Ordner (OneDrive, Dropbox) oder einen beliebigen gemeinsamen Speicherort.
es: Elija un recurso compartido de red, una carpeta sincronizada en la nube (OneDrive, Dropbox) o cualquier ubicación compartida.
fr: Choisissez un partage réseau, un dossier synchronisé dans le cloud (OneDrive, Dropbox) ou tout autre emplacement partagé.
ja: ネットワーク共有、クラウド同期フォルダー(OneDrive、Dropbox)、または任意の共有場所を選択します。
zh_cn: 选择网络共享、云同步文件夹(OneDrive、Dropbox)或任意共享位置。

# Sync_KeyLabel.Text
source: Encryption Key
de: Verschlüsselungsschlüssel
es: Clave de cifrado
fr: Clé de chiffrement
ja: 暗号化キー
zh_cn: 加密密钥

# Sync_KeyBox.PlaceholderText
source: Enter a strong passphrase for AES-256 encryption
de: Geben Sie eine starke Passphrase für die AES-256-Verschlüsselung ein
es: Introduzca una frase de contraseña segura para el cifrado AES-256
fr: Saisissez une phrase secrète robuste pour le chiffrement AES-256
ja: AES-256 暗号化用の強力なパスフレーズを入力
zh_cn: 输入用于 AES-256 加密的强密码短语

# Sync_KeyHint.Text
source: Must be identical on all installations. Use a strong passphrase you will remember.
de: Muss auf allen Installationen identisch sein. Verwenden Sie eine starke Passphrase, die Sie sich merken können.
es: Debe ser idéntica en todas las instalaciones. Use una frase segura que pueda recordar.
fr: Doit être identique sur toutes les installations. Utilisez une phrase secrète robuste dont vous vous souviendrez.
ja: すべてのインストールで同一である必要があります。覚えやすく強力なパスフレーズを使用してください。
zh_cn: 所有安装实例必须使用相同密钥。请使用您能记住的强密码短语。

# Sync_AutoSyncTitle.Text
source: Auto-Sync
es: Sincronización automática
fr: Synchronisation automatique
ja: 自動同期
zh_cn: 自动同步

# Sync_AutoSyncSubtitle.Text
source: Automatically synchronize changes at a regular interval.
de: Änderungen automatisch in einem regelmäßigen Intervall synchronisieren.
es: Sincronice los cambios automáticamente a intervalos regulares.
fr: Synchronisez automatiquement les modifications à intervalle régulier.
ja: 一定の間隔で変更を自動的に同期します。
zh_cn: 按固定间隔自动同步更改。

# Sync_AutoToggle.OnContent
source: On
de: Ein
es: Activado
fr: Activé
ja: オン
zh_cn: 开

# Sync_AutoToggle.OffContent
source: Off
de: Aus
es: Desactivado
fr: Désactivé
ja: オフ
zh_cn: 关

# Sync_IntervalLabel.Text
source: Sync Interval
de: Sync-Intervall
es: Intervalo de sincronización
fr: Intervalle de synchronisation
ja: 同期間隔
zh_cn: 同步间隔

# Sync_ScopeLabel.Text
source: Sync Scope
de: Sync-Umfang
es: Alcance de sincronización
fr: Portée de la synchronisation
ja: 同期範囲
zh_cn: 同步范围

# Sync_ScopeHint.Text
source: Choose whether to sync all data or only selected collections.
de: Wählen Sie, ob alle Daten oder nur ausgewählte Sammlungen synchronisiert werden.
es: Elija si sincronizar todos los datos o solo colecciones seleccionadas.
fr: Choisissez de synchroniser toutes les données ou seulement certaines collections.
ja: すべてのデータを同期するか、選択したコレクションのみを同期するかを選びます。
zh_cn: 选择同步全部数据还是仅同步所选合集。

# Sync_CollectionsLabel.Text
source: Collections to Sync
de: Zu synchronisierende Sammlungen
es: Colecciones para sincronizar
fr: Collections à synchroniser
ja: 同期するコレクション
zh_cn: 要同步的合集

# Sync_ScopedNote.Text
source: Only documents assigned to the selected collections will be included in sync exports.
de: Nur Dokumente aus den ausgewählten Sammlungen werden in Sync-Exporte aufgenommen.
es: Solo los documentos asignados a las colecciones seleccionadas se incluirán en las exportaciones de sincronización.
fr: Seuls les documents affectés aux collections sélectionnées seront inclus dans les exports de synchronisation.
ja: 選択したコレクションに割り当てられたドキュメントのみが同期エクスポートに含まれます。
zh_cn: 只有分配到所选合集的文档才会包含在同步导出中。

# Sync_NoCollections.Text
source: No collections are available yet. Create a collection before using selected-collection sync.
de: Noch keine Sammlungen vorhanden. Erstellen Sie eine Sammlung, bevor Sie die Synchronisierung ausgewählter Sammlungen verwenden.
es: Aún no hay colecciones disponibles. Cree una colección antes de usar la sincronización de colecciones seleccionadas.
fr: Aucune collection disponible pour le moment. Créez une collection avant d'utiliser la synchronisation par collections sélectionnées.
ja: コレクションはまだありません。選択コレクション同期を使う前にコレクションを作成してください。
zh_cn: 尚无可用合集。使用所选合集同步前请先创建合集。

# Sync_SaveLabel.Text
source: Save Configuration
de: Konfiguration speichern
es: Guardar configuración
fr: Enregistrer la configuration
ja: 構成を保存
zh_cn: 保存配置

# Sync_SavingLabel.Text
source: Saving...
de: Wird gespeichert...
es: Guardando...
fr: Enregistrement...
ja: 保存しています...
zh_cn: 正在保存...

# Sync_StatusTitle.Text
source: Sync Status
es: Estado de sincronización
fr: Statut de synchronisation
ja: 同期ステータス
zh_cn: 同步状态

# Sync_RefreshStatusBtn.ToolTipService.ToolTip
source: Refresh sync status
de: Sync-Status aktualisieren
es: Actualizar estado de sincronización
fr: Actualiser le statut de synchronisation
ja: 同期ステータスを更新
zh_cn: 刷新同步状态

# Sync_LastSyncedOverline.Text
source: LAST SYNCED
de: ZULETZT SYNCHRONISIERT
es: ÚLTIMA SINCRONIZACIÓN
fr: DERNIÈRE SYNCHRO
ja: 最終同期
zh_cn: 上次同步

# Sync_PendingOverline.Text
source: PENDING CHANGES
de: AUSSTEHENDE ÄNDERUNGEN
es: CAMBIOS PENDIENTES
fr: MODIFICATIONS EN ATTENTE
ja: 保留中の変更
zh_cn: 待同步更改

# Sync_ItemsLabel.Text
source: items
de: Elemente
es: elementos
fr: éléments
ja: 件
zh_cn: 项

# Sync_DurationOverline.Text
source: DURATION
de: DAUER
es: DURACIÓN
fr: DURÉE
ja: 所要時間
zh_cn: 耗时

# Sync_StateOverline.Text
source: STATE
de: ZUSTAND
es: ESTADO
fr: ÉTAT
ja: 状態
zh_cn: 状态

# Sync_Synchronizing.Text
source: Synchronizing...
de: Synchronisiere...
es: Sincronizando...
fr: Synchronisation...
ja: 同期しています...
zh_cn: 正在同步...

# Sync_AutoBadgeRun.Text
source: AUTO-SYNC ENABLED
de: AUTO-SYNC AKTIV
es: SINCRONIZACIÓN AUTOMÁTICA ACTIVADA
fr: SYNCHRO AUTO ACTIVÉE
ja: 自動同期オン
zh_cn: 自动同步已启用

# Sync_HistoryTitle.Text
source: Sync History
de: Sync-Verlauf
es: Historial de sincronización
fr: Historique de synchronisation
ja: 同期履歴
zh_cn: 同步历史

# Sync_ClearHistoryLabel.Text
source: Clear History
de: Verlauf löschen
es: Borrar historial
fr: Effacer l'historique
ja: 履歴をクリア
zh_cn: 清除历史

# Sync_FocusedTitle.Text
source: Focused Sync History Entry
de: Fokussierter Sync-Verlaufseintrag
es: Entrada de historial enfocada
fr: Entrée d'historique ciblée
ja: フォーカス中の同期履歴エントリ
zh_cn: 聚焦的同步历史条目

# Sync_FocusedHint.Text
source: The matching sync record stays pinned and marked until you dismiss this focus state.
de: Der passende Sync-Eintrag bleibt angeheftet und markiert, bis Sie diesen Fokusstatus schließen.
es: El registro de sincronización correspondiente permanece fijado y marcado hasta que descarte este estado de enfoque.
fr: L'enregistrement de synchronisation correspondant reste épinglé et marqué jusqu'à ce que vous fermiez cet état de focus.
ja: 該当する同期レコードは、このフォーカス状態を閉じるまで固定・マークされたままになります。
zh_cn: 匹配的同步记录将保持置顶并标记,直到您关闭此聚焦状态。

# Sync_DismissBtn.Content
source: Dismiss
de: Ausblenden
es: Descartar
fr: Ignorer
ja: 閉じる
zh_cn: 关闭

# Sync_LoadingHistory.Text
source: Loading sync history...
de: Sync-Verlauf wird geladen...
es: Cargando historial de sincronización...
fr: Chargement de l'historique de synchronisation...
ja: 同期履歴を読み込んでいます...
zh_cn: 正在加载同步历史...

# Sync_OpenedFromOpsBadge.Text
source: Opened from Operations
de: Aus Operations geöffnet
es: Abierto desde Operations
fr: Ouvert depuis Operations
ja: Operations から開きました
zh_cn: 从 Operations 打开

# Sync_ChangesRun.Text
source: changes
de: Änderungen
es: cambios
fr: modifications
ja: 件の変更
zh_cn: 项更改

# Sync_ConflictsRun.Text
source: conflicts
de: Konflikte
es: conflictos
fr: conflits
ja: 件の競合
zh_cn: 项冲突

# Sync_EmptyHistoryTitle.Text
source: No sync history yet
de: Noch kein Sync-Verlauf
es: Aún no hay historial de sincronización
fr: Pas encore d'historique de synchronisation
ja: 同期履歴はまだありません
zh_cn: 暂无同步历史

# Sync_EmptyHistoryHint.Text
source: Sync history will appear here after your first sync operation.
de: Der Sync-Verlauf erscheint hier nach Ihrem ersten Sync-Vorgang.
es: El historial aparecerá aquí tras su primera sincronización.
fr: L'historique apparaîtra ici après votre première synchronisation.
ja: 最初の同期を実行すると、ここに同期履歴が表示されます。
zh_cn: 首次同步后,同步历史将显示在此处。

# Onb_WelcomeTitle.Text
source: Welcome to Agent-X
de: Willkommen bei Agent-X
es: Bienvenido a Agent-X
fr: Bienvenue dans Agent-X
ja: Agent-X へようこそ
zh_cn: 欢迎使用 Agent-X

# Onb_WelcomeSubtitle.Text
source: Your Local-First AI Intelligence Hub
de: Ihr Local-First-KI-Intelligenz-Hub
es: Su centro de inteligencia de IA local
fr: Votre hub d'intelligence IA local-first
ja: ローカルファーストの AI インテリジェンス ハブ
zh_cn: 您的本地优先 AI 智能中心

# Onb_PrivateTitle.Text
source: Private & Secure
de: Privat & sicher
es: Privado y seguro
fr: Privé et sécurisé
ja: プライベートで安全
zh_cn: 私密且安全

# Onb_PrivateDesc.Text
source: Everything runs locally on your machine. Your data never leaves your device.
de: Alles läuft lokal auf Ihrem Rechner. Ihre Daten verlassen niemals Ihr Gerät.
es: Con el modelo integrado, u Ollama en este equipo, sus documentos y conversaciones se procesan aquí. Los proveedores en la nube, la búsqueda web del modo investigación y los conectores de correo y calendario solo envían datos si usted los configura.
fr: Tout s'exécute localement sur votre machine. Vos données ne quittent jamais votre appareil.
ja: すべてがお使いのマシン上でローカルに動作します。データがデバイスの外に出ることはありません。
zh_cn: 一切都在您的电脑本地运行。您的数据永远不会离开设备。

# Onb_FreeTitle.Text
source: Unlimited & Free
de: Unbegrenzt & kostenlos
es: Modelos locales gratuitos
fr: Illimité et gratuit
ja: 無制限・無料
zh_cn: 无限制且免费

# Onb_FreeDesc.Text
source: Powered by local open-source AI models via Ollama. Optionally connect to OpenAI or Anthropic Claude for cloud-based models.
de: Angetrieben von lokalen Open-Source-KI-Modellen über Ollama. Optional können Sie OpenAI oder Anthropic Claude für Cloud-Modelle verbinden.
es: Los modelos locales, el integrado o los que ejecuta en Ollama, no cuestan nada. OpenAI y Anthropic Claude son opcionales, y esos proveedores le cobran lo que use.
fr: Propulsé par des modèles d'IA open source locaux via Ollama. Connectez éventuellement OpenAI ou Anthropic Claude pour des modèles cloud.
ja: Ollama によるローカルのオープンソース AI モデルで動作します。必要に応じて OpenAI や Anthropic Claude のクラウド モデルにも接続できます。
zh_cn: 由 Ollama 驱动的本地开源 AI 模型提供支持。也可选择连接 OpenAI 或 Anthropic Claude 使用云端模型。

# Onb_DataTitle.Text
source: Your Data, Your Rules
de: Ihre Daten, Ihre Regeln
es: Sus datos, sus reglas
fr: Vos données, vos règles
ja: あなたのデータ、あなたのルール
zh_cn: 您的数据,您做主

# Onb_DataDesc.Text
source: Index your documents, search semantically, and chat with your files. Use local AI for full privacy, or optional cloud providers for additional model choices.
de: Indizieren Sie Ihre Dokumente, suchen Sie semantisch und chatten Sie mit Ihren Dateien. Nutzen Sie lokale KI für volle Privatsphäre oder optionale Cloud-Anbieter für mehr Modellauswahl.
es: Indexe sus documentos, busque semánticamente y chatee con sus archivos. Use IA local para privacidad total, o proveedores en la nube opcionales para más opciones de modelos.
fr: Indexez vos documents, recherchez sémantiquement et discutez avec vos fichiers. Utilisez l'IA locale pour une confidentialité totale, ou des fournisseurs cloud optionnels pour plus de choix de modèles.
ja: ドキュメントをインデックス化し、セマンティック検索を行い、ファイルとチャットできます。完全なプライバシーにはローカル AI を、モデルの選択肢を増やすには任意のクラウド プロバイダーを利用してください。
zh_cn: 为文档建立索引、进行语义搜索并与文件对话。使用本地 AI 获得完全隐私,或选用云服务商获取更多模型选择。

# Onb_OllamaTitle.Text
source: Connect to Ollama
de: Mit Ollama verbinden
es: Conectar con Ollama
fr: Se connecter à Ollama
ja: Ollama に接続
zh_cn: 连接 Ollama

# Onb_OllamaDesc.Text
source: Agent-X uses Ollama to run AI models locally on your machine. Ollama is a free, open-source tool that manages and serves AI models. You can also configure OpenAI or Anthropic providers later in Settings.
de: Agent-X verwendet Ollama, um KI-Modelle lokal auf Ihrem Rechner auszuführen. Ollama ist ein kostenloses Open-Source-Tool, das KI-Modelle verwaltet und bereitstellt. OpenAI- oder Anthropic-Anbieter können Sie später in den Einstellungen konfigurieren.
es: Ollama es una herramienta gratuita que ejecuta modelos de código abierto en su equipo. Es opcional: Agent-X también tiene un modelo integrado, que se ofrece unos pasos más adelante, así que omita este paso si no usa Ollama. Las claves de OpenAI y Anthropic se pueden añadir en ese paso posterior o en Configuración.
fr: Agent-X utilise Ollama pour exécuter des modèles d'IA localement sur votre machine. Ollama est un outil gratuit et open source qui gère et sert les modèles d'IA. Vous pourrez aussi configurer les fournisseurs OpenAI ou Anthropic plus tard dans les Paramètres.
ja: Agent-X は Ollama を使って AI モデルをローカルで実行します。Ollama は AI モデルを管理・提供する無料のオープンソース ツールです。OpenAI や Anthropic のプロバイダーは、後から設定で構成することもできます。
zh_cn: Agent-X 使用 Ollama 在您的电脑本地运行 AI 模型。Ollama 是一款免费开源工具,用于管理和提供 AI 模型。您也可以稍后在设置中配置 OpenAI 或 Anthropic。

# Onb_EndpointOverline.Text
source: OLLAMA ENDPOINT
de: OLLAMA-ENDPUNKT
es: ENDPOINT DE OLLAMA
fr: POINT DE TERMINAISON OLLAMA
ja: OLLAMA エンドポイント
zh_cn: OLLAMA 端点

# Onb_TestConnBtn.Content
source: Test Connection
de: Verbindung testen
es: Probar conexión
fr: Tester la connexion
ja: 接続をテスト
zh_cn: 测试连接

# Onb_OllamaHelpRun1.Text
source: Don't have Ollama? Visit
de: Sie haben Ollama nicht? Besuchen Sie
es: ¿No tiene Ollama? Visite
fr: Vous n'avez pas Ollama ? Rendez-vous sur
ja: Ollama をお持ちでない場合は
zh_cn: 没有 Ollama?请访问

# Onb_OllamaHelpRun2.Text
source: to install it.
de: um es zu installieren.
es: para instalarlo.
fr: pour l'installer.
ja: からインストールしてください。
zh_cn: 进行安装。

# Onb_SkipBtn.Content
source: Skip for now — I'll set it up later
de: Vorerst überspringen — ich richte es später ein
es: Omitir por ahora, lo configuraré más tarde
fr: Ignorer pour l'instant — je le configurerai plus tard
ja: 今はスキップ — 後で設定します
zh_cn: 暂时跳过 — 稍后再设置

# Onb_ModelsTitle.Text
source: Choose Your Models
de: Wählen Sie Ihre Modelle
es: Elija sus modelos
fr: Choisissez vos modèles
ja: モデルを選択
zh_cn: 选择您的模型

# Onb_ModelsDesc.Text
source: Select a default chat model and an embedding model for semantic search.
de: Wählen Sie ein Standard-Chatmodell und ein Embedding-Modell für die semantische Suche.
es: Seleccione un modelo de chat predeterminado y un modelo de embeddings para la búsqueda semántica.
fr: Sélectionnez un modèle de discussion par défaut et un modèle d'embedding pour la recherche sémantique.
ja: 既定のチャット モデルと、セマンティック検索用の埋め込みモデルを選択します。
zh_cn: 选择默认聊天模型和用于语义搜索的嵌入模型。

# Onb_LoadingModels.Text
source: Loading available models...
de: Verfügbare Modelle werden geladen...
es: Cargando modelos disponibles...
fr: Chargement des modèles disponibles...
ja: 利用可能なモデルを読み込んでいます...
zh_cn: 正在加载可用模型...

# Onb_ChatModelOverline.Text
source: CHAT MODEL
de: CHATMODELL
es: MODELO DE CHAT
fr: MODÈLE DE CHAT
ja: チャット モデル
zh_cn: 聊天模型
